# MEPAnalytical Segment Set Loss Coefficient Override Method

Source: https://www.revitapidocs.com/2026/9b1410ea-3287-bed3-3c07-1614b7b92010.htm

---

| MEPAnalytical Segment Set Loss Coefficient Override Method |
| --- |

Sets the overridden value of loss coefficient.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetLossCoefficientOverride(
	MEPAnalyticalModelData analyticalModel,
	double lossCoefficient
)
```

```
Public Sub SetLossCoefficientOverride (
	analyticalModel As MEPAnalyticalModelData,
	lossCoefficient As Double
)
```

```
public:
void SetLossCoefficientOverride(
	MEPAnalyticalModelData^ analyticalModel,
	double lossCoefficient
)
```

```
member SetLossCoefficientOverride :
        analyticalModel : MEPAnalyticalModelData *
        lossCoefficient : float -> unit
```

#### Parameters

analyticalModel MEPAnalyticalModelData
:   The analytical model data that this segment belongs to.

lossCoefficient Double
:   The new loss coefficient value, dimensionless.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

MEPAnalyticalSegment Class Autodesk.Revit.DB.Analysis Namespace